; domain
(define (domain MAPF)
    (:requirements :strips :disjunctive-preconditions)

    (:predicates
        (agent ?agentID)
        (agent-on-vertex ?agentID ?vertexID)

        (vertex ?vertexID)
        (vertex-empty ?vertexID)
        (neighbor-vertexes ?vertex1 ?vertex2)
        (distinct ?vertex1 ?vertex2)
    )

    (:action move-agent
        :parameters (?fromVertex ?toVertex ?agent)

        :precondition( and
            ( or
                (distinct ?fromVertex ?toVertex)
                (distinct ?toVertex ?fromVertex)
            )
            (vertex ?fromVertex)
            (vertex ?toVertex)
            (agent ?agent)
            (agent-on-vertex ?agent ?fromVertex)
            (vertex-empty ?toVertex)
            ( or
                (neighbor-vertexes ?fromVertex ?toVertex)
                (neighbor-vertexes ?toVertex ?fromVertex)
            )
        )

        :effect( and
            (not (agent-on-vertex ?agent ?fromVertex))
            (not (vertex-empty ?toVertex))
            (agent-on-vertex ?agent ?toVertex)
            (vertex-empty ?fromVertex)
        )
    )
)

; problem
(define (problem MAPF_config)
    (:domain MAPF)
    (:requirements :strips)
    (:objects
        agent1 agent2 vertex1 vertex2 vertex3 vertex4 vertex5 vertex6 vertex7 vertex8
    )
    (:init
        (agent agent1)
        (agent agent2)

        (vertex vertex1)
        (vertex vertex2)
        (vertex vertex3)
        (vertex vertex4)
        (vertex vertex5)
        (vertex vertex6)
        (vertex vertex7)
        (vertex vertex8)

        (agent-on-vertex agent1 vertex1)
        (agent-on-vertex agent2 vertex2)

        (vertex-empty vertex3)
        (vertex-empty vertex4)
        (vertex-empty vertex5)
        (vertex-empty vertex6)
        (vertex-empty vertex7)
        (vertex-empty vertex8)

        (distinct vertex1 vertex2)
        (distinct vertex1 vertex3)
        (distinct vertex1 vertex4)
        (distinct vertex1 vertex5)
        (distinct vertex1 vertex6)
        (distinct vertex1 vertex7)
        (distinct vertex1 vertex8)
        (distinct vertex2 vertex3)
        (distinct vertex2 vertex4)
        (distinct vertex2 vertex5)
        (distinct vertex2 vertex6)
        (distinct vertex2 vertex7)
        (distinct vertex2 vertex8)
        (distinct vertex3 vertex4)
        (distinct vertex3 vertex5)
        (distinct vertex3 vertex6)
        (distinct vertex3 vertex7)
        (distinct vertex3 vertex8)
        (distinct vertex4 vertex5)
        (distinct vertex4 vertex6)
        (distinct vertex4 vertex7)
        (distinct vertex4 vertex8)
        (distinct vertex5 vertex6)
        (distinct vertex5 vertex7)
        (distinct vertex5 vertex8)
        (distinct vertex6 vertex7)
        (distinct vertex6 vertex8)
        (distinct vertex7 vertex8)

        (neighbor-vertexes vertex1 vertex2)
        ;(neighbor-vertexes vertex1 vertex3)
        ;(neighbor-vertexes vertex1 vertex4)
        ;(neighbor-vertexes vertex1 vertex5)
        ;(neighbor-vertexes vertex1 vertex6)
        ;(neighbor-vertexes vertex1 vertex7)
        ;(neighbor-vertexes vertex1 vertex8)
        (neighbor-vertexes vertex2 vertex3)
        (neighbor-vertexes vertex2 vertex4)
        (neighbor-vertexes vertex2 vertex5)
        ;(neighbor-vertexes vertex2 vertex6)
        ;(neighbor-vertexes vertex2 vertex7)
        ;(neighbor-vertexes vertex2 vertex8)
        (neighbor-vertexes vertex3 vertex4)
        (neighbor-vertexes vertex3 vertex5)
        (neighbor-vertexes vertex3 vertex6)
        ;(neighbor-vertexes vertex3 vertex7)
        ;(neighbor-vertexes vertex3 vertex8)
        (neighbor-vertexes vertex4 vertex5)
        (neighbor-vertexes vertex4 vertex6)
        (neighbor-vertexes vertex4 vertex7)
        ;(neighbor-vertexes vertex4 vertex8)
        (neighbor-vertexes vertex5 vertex6)
        (neighbor-vertexes vertex5 vertex7)
        (neighbor-vertexes vertex5 vertex8)
        (neighbor-vertexes vertex6 vertex7)
        ;(neighbor-vertexes vertex6 vertex8)
        (neighbor-vertexes vertex7 vertex8)
    )

    (:goal( and
            (agent-on-vertex agent1 vertex6)
            (agent-on-vertex agent2 vertex8)
        )
    )
)

; plan
1. (move-agent vertex2 vertex5 agent2)
   deleted: (agent-on-vertex agent2 vertex2) (vertex-empty vertex5)
   added: (agent-on-vertex agent2 vertex5) (vertex-empty vertex2)
   goals met: 0 of 2
2. (move-agent vertex5 vertex8 agent2)
   deleted: (agent-on-vertex agent2 vertex5) (vertex-empty vertex8)
   added: (agent-on-vertex agent2 vertex8) (vertex-empty vertex5)
   goals met: 1 of 2
3. (move-agent vertex1 vertex2 agent1)
   deleted: (agent-on-vertex agent1 vertex1) (vertex-empty vertex2)
   added: (agent-on-vertex agent1 vertex2) (vertex-empty vertex1)
   goals met: 1 of 2
4. (move-agent vertex2 vertex3 agent1)
   deleted: (agent-on-vertex agent1 vertex2) (vertex-empty vertex3)
   added: (agent-on-vertex agent1 vertex3) (vertex-empty vertex2)
   goals met: 1 of 2
5. (move-agent vertex3 vertex6 agent1)
   deleted: (agent-on-vertex agent1 vertex3) (vertex-empty vertex6)
   added: (agent-on-vertex agent1 vertex6) (vertex-empty vertex3)
   goals met: 2 of 2
